// 圧電ブザーを使います
// 12音
// C(ド), C#, D, D#, E, F, F#, G, G#, A, A#, B
const int SCALE[] = {33, 35, 37, 39, 41, 44, 46, 49, 52, 55, 58, 62,
                   65, 69, 73, 78, 82, 87, 93, 98, 104, 110, 117, 123,
                   131, 139, 147, 156, 165, 175, 185, 196, 208, 220, 233, 247,
                   262, 277, 294, 311, 330, 349, 370, 392, 415, 440, 466, 494,
                   523, 554, 587, 622, 659, 698, 740, 784, 831, 880, 932, 988,
                   1047, 1109, 1175, 1245, 1319, 1397, 1480, 1568, 1661, 1760, 1865, 1976,
                   2093, 2217, 2349, 2489, 2637, 2794, 2960, 3136, 3322, 3520, 3729, 3951
                  };
// 音の長さを指定
#define BEAT 100

// 圧電スピーカを接続したピン番号
#define PINNO 12

// 音階
int scaleIndex = 0;

void setup() {
  Serial.begin(9600);
}

void loop() {
  int val = analogRead(0);
  Serial.println(val);
  
  if (digitalRead(5) == HIGH) {
    digitalWrite(PINNO, LOW) ;
  } else {
    int output = map(val, 100, 1000, 0, 83);
    tone(PINNO, SCALE[output], BEAT) ;
    delay(BEAT) ;
  }
}

